{
  "backend/main.mo": "Motoko backend storing a list of news items with publish, remove, and query methods using a timestamp field.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all major frontend components and pages.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing and React Query provider, defining main routes including News.",
  "frontend/src/components/Footer.tsx": "Footer displaying logo, credits, and attribution.",
  "frontend/src/components/Header.tsx": "Responsive header with desktop and mobile navigation using a sheet menu.",
  "frontend/src/components/ImageSlider.tsx": "Image carousel component with autoplay, hover pause, and navigation controls.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper with header, footer, and routed content outlet.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the authenticated backend actor with access control initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication provider and hook handling login, logout, and identity persistence.",
  "frontend/src/hooks/useNews.ts": "No summary available.",
  "frontend/src/hooks/useQueries.ts": "No summary available.",
  "frontend/src/index.css": "No summary available.",
  "frontend/src/main.tsx": "No summary available.",
  "frontend/src/pages/AboutPage.tsx": "No summary available.",
  "frontend/src/pages/HistoryPage.tsx": "No summary available.",
  "frontend/src/pages/HomePage.tsx": "No summary available.",
  "frontend/src/pages/InnovationsPage.tsx": "No summary available.",
  "frontend/src/pages/MembersPage.tsx": "No summary available.",
  "frontend/src/pages/NewsPage.tsx": "Implements the PIN-gated news management UI, including dialogs for adding and removing news, form validation, and rendering existing news with images.",
  "frontend/src/utils/newsDate.ts": "Validates user-entered month/day/year values and converts them into a bigint timestamp in nanoseconds.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with sessionStorage support and hash/query parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes the project state, including feature requirements, known issues, and configuration metadata."
}