{
  "backend/main.mo": "Defines an empty Motoko actor with no methods or state, serving as a placeholder backend canister.",
  "feature_evidence.json": "Feature evidence report describing a frontend update to display images on innovation cards, including mapped filenames, affected file, dependencies, and confidence level.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files, outlining components, pages, hooks, styles, and their responsibilities.",
  "frontend/index.html": "HTML entry point that defines the root element and loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router routes and wrapping the app with React Query’s QueryClientProvider.",
  "frontend/src/components/Footer.tsx": "Footer component showing the Swift Energy logo, copyright notice with caffeine.ai attribution, and a \"Powered by CK Education\" tagline.",
  "frontend/src/components/Header.tsx": "Responsive header with Swift Energy branding and navigation links, featuring a desktop menu and a mobile hamburger menu using a slide-out sheet.",
  "frontend/src/components/ImageSlider.tsx": "Reusable image carousel component built with shadcn/ui that auto-plays every 4 seconds, pauses on hover, and supports swipe and navigation controls.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that renders the Header, page content via Outlet, and Footer in a full-height flex column.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor using React Query, handling authenticated and anonymous identities and initializing access control when available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication, including login, logout, identity persistence, and login status state.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty hook file indicating no backend queries are required for this static website.",
  "frontend/src/index.css": "Global Tailwind CSS styles defining Swift Energy’s OKLCH-based color system, light/dark themes, and utility patterns.",
  "frontend/src/main.tsx": "React entry point that creates the root, applies global styles, and wraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Implements the About page with an image slider, hero section, goals/vision/values cards, and a team members section describing roles and bios.",
  "frontend/src/pages/HistoryPage.tsx": "Implements the History page with an image slider, hero section, and a timeline of milestones showing Swift Energy’s journey and achievements.",
  "frontend/src/pages/HomePage.tsx": "Implements the Home page hero section introducing Swift Energy, call-to-action buttons, and a core values section rendered as cards.",
  "frontend/src/pages/InnovationsPage.tsx": "Implements the Innovations page with an image slider, hero section, and detailed cards showcasing the team’s innovation projects.",
  "frontend/src/pages/MembersPage.tsx": "Empty or unimplemented page file with no content defined.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read URL parameters from query or hash, persist them in sessionStorage, and clear stored or hash parameters safely.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens via CSS variables, animations, container settings, and enabled plugins.",
  "project_state.json": "Project metadata snapshot describing the Swift Energy Website, including schema/version info, a high-level architecture summary, and a detailed catalog of existing frontend features and pages. Used for build planning and feature tracking rather than runtime behavior."
}