{
  "backend/main.mo": "Motoko actor storing news items in a map with functions to publish, remove, and fetch all news.",
  "feature_evidence.json": "Feature evidence report listing language selector and language state/persistence features with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including components, pages, hooks, and utilities.",
  "frontend/index.html": "Basic HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up router routes, React Query provider, and wraps the app with the LanguageProvider.",
  "frontend/src/components/Footer.tsx": "Footer showing Swift Energy branding, attribution, and CK Education credit.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, nav links, mobile menu, and a globe-based LanguageSelector.",
  "frontend/src/components/ImageSlider.tsx": "Reusable auto‑playing image carousel with hover pause and navigation controls.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown menu allowing users to pick a language and showing the current selection.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper with header, outlet content, and footer.",
  "frontend/src/context/LanguageContext.tsx": "Provides language state, available languages list, and localStorage persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on authentication state and initializes access control when available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, and identity loading. Wraps AuthClient creation with custom options and exposes login state helpers.",
  "frontend/src/hooks/useLanguage.ts": "Simple hook that returns the current language context and throws if used outside a LanguageProvider.",
  "frontend/src/hooks/useNews.ts": "React Query hooks to fetch, publish, and remove news entries via an actor, with cache invalidation on mutations.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode overrides, and utility styles including a grid background pattern.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and the Internet Identity provider before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with an image slider, team goals, vision, values, and member profiles.",
  "frontend/src/pages/HistoryPage.tsx": "Displays the team’s history with an image slider and a timeline of milestones.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero section, team introduction, and a list of core values with navigation links.",
  "frontend/src/pages/InnovationsPage.tsx": "Renders an innovations page with an image slider, hero section, and cards describing three innovation projects.",
  "frontend/src/pages/MembersPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/newsManagementFlow.ts": "Defines the reducer, state, and actions for managing the PIN, add, and remove flows in the news management UI.",
  "frontend/src/pages/NewsPage.tsx": "Implements the news page with image slider, news listing, and admin PIN‑gated flow for adding or removing news using a reducer state machine.",
  "frontend/src/utils/newsDate.ts": "Validates month/day/year inputs and converts them into a bigint nanosecond timestamp.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures TailwindCSS customization including colors, containers, animations, and plugins.",
  "project_state.json": "Defines project metadata, existing language selector features, and a pending request to add a globe‑icon language menu with multiple supported languages. Includes architectural notes, versions, and project configuration details."
}