{
  "backend/main.mo": "Motoko actor managing news items with publish, remove, and fetch operations using a list store and mixin-based blob storage.",
  "feature_evidence.json": "Feature evidence report listing three NewsPage-related UI workflow features, their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of each frontend file including pages, components, hooks, and utilities.",
  "frontend/index.html": "Basic HTML entry point mounting the React app into the root div and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and React Query provider, wiring layout and pages including NewsPage.",
  "frontend/src/components/Footer.tsx": "Footer with Swift Energy branding, attribution, and CK Education tagline.",
  "frontend/src/components/Header.tsx": "Responsive header with logo and navigation links, including mobile sheet menu.",
  "frontend/src/components/ImageSlider.tsx": "Auto‑advancing image carousel with hover‑pause, gradient overlays, and navigation controls.",
  "frontend/src/components/Layout.tsx": "App shell providing header, footer, and routed page content via Outlet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor tied to Internet Identity, handling access control initialization and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hooks for managing Internet Identity login, stored identity loading, and logout behavior.",
  "frontend/src/hooks/useNews.ts": "Defines React Query hooks for fetching, publishing, and removing news via an actor with cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing for unused backend queries.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for light/dark themes, plus global styles and a grid background pattern.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with an image slider, team mission sections, and member bios.",
  "frontend/src/pages/HistoryPage.tsx": "Implements the History page with an image slider and a timeline of team milestones.",
  "frontend/src/pages/HomePage.tsx": "Builds the Home page featuring a hero banner, team intro, and core values section.",
  "frontend/src/pages/InnovationsPage.tsx": "Displays the Innovations page with a slider and detailed cards describing team innovation projects.",
  "frontend/src/pages/MembersPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/newsManagementFlow.ts": "Defines the state machine, actions, and reducer used to manage the PIN → options → add/remove news flow.",
  "frontend/src/pages/NewsPage.tsx": "Implements the News page UI with image slider, PIN-gated add/remove news flow, and handlers for publishing and removing news items.",
  "frontend/src/utils/newsDate.ts": "Validates month/day/year inputs and converts them to a bigint nanosecond timestamp.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and manipulating hash-based query params.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugins.",
  "project_state.json": "Stores project metadata describing requirements and issues for reworking the NewsPage '+' button and PIN/options flow."
}