{
  "backend/main.mo": "Motoko backend storing news items with publish, remove-by-title, and fetch-all operations.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing major frontend files and their roles.",
  "frontend/index.html": "Root HTML file bootstrapping the frontend and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with React Query provider.",
  "frontend/src/components/Footer.tsx": "Footer showing logo, copyright text, and external attribution.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links and mobile drawer menu.",
  "frontend/src/components/ImageSlider.tsx": "Reusable auto-playing carousel component with hover pause and navigation controls.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper providing header, footer, and routed content outlet.",
  "frontend/src/hooks/useActor.ts": "Hook managing creation and lifecycle of backend actors tied to Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context and provider offering login, logout, and identity state.",
  "frontend/src/hooks/useNews.ts": "Provides React Query hooks to fetch, publish, and delete news through an actor API, with cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing.",
  "frontend/src/index.css": "Tailwind CSS base styles and theme variables for light and dark modes, including layout and background utilities.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page with an image slider, team overview, goals, vision, values, and member descriptions.",
  "frontend/src/pages/HistoryPage.tsx": "Displays the team's history with milestone timeline and an image slider.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring hero section, team description, navigation buttons, and core values list.",
  "frontend/src/pages/InnovationsPage.tsx": "Shows innovation projects with an image slider and detailed cards for each project.",
  "frontend/src/pages/MembersPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/NewsPage.tsx": "React page handling news display plus PIN-gated add/remove workflows, including dialogs, form validation, and integration with publish/remove hooks.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning or retrieving stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing implemented features, pending requests, and the overall news-page improvement objectives."
}