{
  "kind": "build_request",
  "title": "Add language selection menu with globe icon in header (desktop + mobile)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a language selector UI to the header with a globe (earth) icon button. On desktop (md and up), place the globe button immediately to the right of the existing \"News\" navigation link in the header’s desktop navigation row. On mobile (below md), place a globe icon button next to the existing hamburger (3 lines) menu button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "can you add a languages menu there will be a button with a earth symbol right beside the News button(computer) or beside the 3 lines (in phone) when clicked a menu will be available to select languages"
        ]
      },
      "acceptanceCriteria": [
        "On desktop widths, a globe icon button is visible directly next to the \"News\" link in the header navigation area.",
        "On mobile widths, a globe icon button is visible next to the hamburger menu button in the header.",
        "Clicking/tapping the globe icon opens a menu/popup that lists available languages for selection.",
        "The language selector UI is accessible: icon button has an aria-label, and menu items are keyboard-navigable."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement language selection state with default language set to English on first app load. Provide a menu list containing exactly these languages (displayed in English): English (default), Hindi, Kazakhstan, Chinese, Spanish, Thailand, Russian, Japanese, French, Portugese, Italian, Arabic, Tagalog, Vietnamese, Indonesian. Selecting a language should immediately update the current selection state and reflect the selected item visually in the menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "select languages which are English which is standard and is picked immediately when the app opens and the languages for Hindi, Kazakhstan, Chinese, Spanish, Thailand, russian, japanese, french, portugese, italian, arabic, tagalog, vietnamese, indonesian"
        ]
      },
      "acceptanceCriteria": [
        "On first load (with no prior selection), English is selected by default.",
        "The menu lists the languages: English, Hindi, Kazakhstan, Chinese, Spanish, Thailand, Russian, Japanese, French, Portugese, Italian, Arabic, Tagalog, Vietnamese, Indonesian.",
        "When a user selects a language, the menu indicates the selected language (e.g., checkmark or highlighted state).",
        "The selected language is available to the rest of the app via a shared state mechanism (e.g., context/provider or a dedicated hook)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Persist the selected language on the client so that refreshing the page or reopening the app restores the previously selected language; if no persisted value exists, fall back to English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ]
      },
      "acceptanceCriteria": [
        "After selecting a non-English language and refreshing the page, the selected language remains the same.",
        "If persisted language data is cleared, the app returns to English as the default on next load."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (compose using existing UI components instead).",
    "Do not modify immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not translate existing page content into the selected languages in this change (language selection only).",
    "No backend changes or persistence to the Motoko canister are required for language selection."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}