{
  "kind": "build_request",
  "title": "Fix NewsPage add-flow gating and preserve user-entered newspaper date",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Rework the NewsPage PIN-gated “+” flow so clicking the floating “+” button only opens the PIN dialog; after a correct PIN, only show the Options dialog, and do not open the Add Newspaper form unless the user explicitly clicks the “Add a Newspaper” option.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "bro rework it when i click the + button it immediately opens the add newspaper can you make it only open if i click the Add a Newspaper in the option part after i enter the pin."
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks the floating “+” button, only the “Enter PIN” dialog opens.",
        "After entering the correct PIN (93023) and submitting, the “Option” dialog opens and neither the Add form dialog nor the Remove dialog opens automatically.",
        "Clicking the “Add a Newspaper” option closes the Options dialog and opens the Add Newspaper form dialog.",
        "Clicking the “Remove News/Remove a Newspaper” option closes the Options dialog and opens the Remove dialog.",
        "All user-facing labels for the add option use English text and read “Add a Newspaper” (not “Add News”)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Preserve the user-entered date when publishing a newspaper: use the Month/Day/Year values from the Add Newspaper form as the stored/displayed date for the new item, instead of overwriting it with the current date/time at upload.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Also when i upload a newspaper it immediately changes the date to the current date."
        ]
      },
      "acceptanceCriteria": [
        "Publishing a news item stores a date derived from the form’s Month/Day/Year inputs and the news list displays that stored date for the new item.",
        "The backend no longer unconditionally uses Time.now() as the published item’s date when the user provided a date.",
        "If the user enters an invalid date (e.g., non-numeric values or impossible month/day), the form shows an English validation error and does not publish.",
        "Existing news items already stored continue to render without errors (they may keep their existing stored timestamps)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the backend publish API to accept a caller-provided timestamp (or optional timestamp) for the news item time field, and update the frontend publish hook to send the computed timestamp based on the form date inputs.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Also when i upload a newspaper it immediately changes the date to the current date."
        ]
      },
      "acceptanceCriteria": [
        "Backend publish method supports receiving the intended time value from the frontend (while remaining compatible with existing stored news records).",
        "Frontend publish mutation passes the computed time value when publishing from the form.",
        "News item display continues to use the stored time value for formatting (no client-side substitution to “today”)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Changing the PIN value (93023) or adding a new authentication system beyond the existing PIN gate.",
    "Adding rich media uploads (PDF/images) for newspapers; this change is only about the add/remove flow and the date being stored/displayed correctly.",
    "Redesigning unrelated pages (Home/About/History/Innovations) beyond what’s needed to implement these fixes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}