{
  "kind": "build_request",
  "title": "Rework NewsPage “+” button PIN/options flow to prevent auto-opening Add Newspaper",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the News page (Fill in your Newspaper flow), rebuild the floating “+” button interaction so it never opens the “Fill in your Newspaper” (Add a Newspaper) form directly. Clicking “+” must only open the PIN dialog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6",
          "recent-messages-10"
        ],
        "quotes": [
          "rework it when i click the + button it immediately opens the add newspaper",
          "remake the whole button and system for the fill newspaper page"
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks the floating “+” button, only the PIN dialog opens.",
        "After clicking “+”, the Add form dialog is not opened unless the user later selects “Add a Newspaper” from the Options UI.",
        "If the user closes the PIN dialog (Cancel / outside click / Escape), no other dialog (Options/Add/Remove) opens."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Rework the PIN submit behavior on NewsPage so that after entering the correct PIN, the app shows only the Options UI (with “Add a Newspaper” and “Remove a Newspaper”) and does not automatically trigger either option due to keyboard events (e.g., pressing Enter in the PIN field).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6",
          "recent-messages-10"
        ],
        "quotes": [
          "can you make it only open if i click the Add a Newspaper in the option part after i enter the pin"
        ]
      },
      "acceptanceCriteria": [
        "After a correct PIN, the Options dialog opens and remains open until the user clicks an option or closes it.",
        "Pressing Enter in the PIN field submits the PIN but does not immediately open the Add form or Remove flow unless the user explicitly clicks an option in the Options dialog.",
        "After an incorrect PIN, the PIN dialog remains open and no other dialog opens."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement a single, explicit state-driven flow for the NewsPage management dialogs (PIN → Options → Add or Remove) that prevents conflicting dialog states (e.g., Options and Add open at the same time) and ensures consistent reset behavior when dialogs are closed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6",
          "recent-messages-10"
        ],
        "quotes": [
          "remake the whole button and system for the fill newspaper page"
        ]
      },
      "acceptanceCriteria": [
        "At most one of these dialogs is open at any time: PIN dialog, Options dialog, Add form dialog, Remove dialog.",
        "Closing any dialog returns the user to a predictable state (e.g., closing Options returns to the News page with no dialog open).",
        "Re-opening the “+” flow after a prior attempt starts from a clean state (PIN input cleared, errors cleared, and no previously-open dialog is shown)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything under frontend/src/components/ui (compose them only).",
    "Keep the backend API and data model unchanged for this request; this is a frontend interaction/flow fix on NewsPage."
  ],
  "nonGoals": [
    "Changing the correct PIN value (currently CORRECT_PIN = '93023').",
    "Redesigning the News publishing/removal backend logic or storage.",
    "Adding new authentication mechanisms beyond the existing PIN-gated UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}