{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix NewsPage PIN-gated add flow and preserve user-entered newspaper date",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Adjust NewsPage PIN-gated “+” workflow so dialogs open only in the intended order and option labels use English “Add a Newspaper”.",
      "acceptanceCriteria": [
        "When the user clicks the floating “+” button, only the “Enter PIN” dialog opens.",
        "After entering the correct PIN (93023) and submitting, the “Option” dialog opens and neither the Add form dialog nor the Remove dialog opens automatically.",
        "Clicking the “Add a Newspaper” option closes the Options dialog and opens the Add Newspaper form dialog.",
        "Clicking the “Remove News/Remove a Newspaper” option closes the Options dialog and opens the Remove dialog.",
        "All user-facing labels for the add option use English text and read “Add a Newspaper” (not “Add News”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/NewsPage.tsx",
          "operation": "modify",
          "description": "Rework the floating “+” click + PIN submit state transitions so “+” only opens the PIN dialog, successful PIN only opens the Options dialog, and the Add/Remove dialogs only open when their respective option buttons are clicked; ensure any dialog close/reset logic prevents unintended auto-opening. Also update the Options dialog button label to exactly “Add a Newspaper” (English) and ensure remove option text remains English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Preserve and validate the user-entered Month/Day/Year when publishing so the stored/displayed news date matches the form input.",
      "acceptanceCriteria": [
        "Publishing a news item stores a date derived from the form’s Month/Day/Year inputs and the news list displays that stored date for the new item.",
        "The backend no longer unconditionally uses Time.now() as the published item’s date when the user provided a date.",
        "If the user enters an invalid date (e.g., non-numeric values or impossible month/day), the form shows an English validation error and does not publish.",
        "Existing news items already stored continue to render without errors (they may keep their existing stored timestamps)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/newsDate.ts",
          "operation": "create",
          "description": "Add a small date utility to (1) validate Month/Day/Year inputs (numeric and real calendar date) and (2) compute a bigint timestamp value compatible with the app’s existing date formatting (used by News.time). Return a clear error message for invalid dates (English)."
        },
        {
          "path": "frontend/src/pages/NewsPage.tsx",
          "operation": "modify",
          "description": "Use the new date utility to validate the Month/Day/Year fields before publishing; on invalid input, show an English validation error and do not submit. On valid input, compute the intended timestamp and pass it through the publish flow so the stored/displayed date matches the user-entered date (no client-side substitution to “today”). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the frontend publish hook to send the caller-provided timestamp when publishing news.",
      "acceptanceCriteria": [
        "Backend publish method supports receiving the intended time value from the frontend (while remaining compatible with existing stored news records).",
        "Frontend publish mutation passes the computed time value when publishing from the form.",
        "News item display continues to use the stored time value for formatting (no client-side substitution to “today”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useNews.ts",
          "operation": "modify",
          "description": "Update the publish mutation to accept a timestamp argument and call the backend publish capability with (title, description, timestamp); keep query invalidation behavior unchanged."
        },
        {
          "path": "frontend/src/pages/NewsPage.tsx",
          "operation": "modify",
          "description": "Update the publish call site to pass the computed timestamp from the form date inputs into the updated publish hook; ensure the news list continues to format and display the stored News.time value as-is. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}