{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add header language selector with persistent client state",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an accessible globe icon button in the header that opens a language selection menu on both desktop and mobile, positioned per breakpoint rules.",
      "acceptanceCriteria": [
        "On desktop widths, a globe icon button is visible directly next to the \"News\" link in the header navigation area.",
        "On mobile widths, a globe icon button is visible next to the hamburger menu button in the header.",
        "Clicking/tapping the globe icon opens a menu/popup that lists available languages for selection.",
        "The language selector UI is accessible: icon button has an aria-label, and menu items are keyboard-navigable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LanguageSelector.tsx",
          "operation": "create",
          "description": "Create a reusable LanguageSelector component that renders a globe icon button (aria-label=\"Select language\") and an accessible, keyboard-navigable popup menu (supports focus management and Escape/Arrow key navigation) without modifying any files under frontend/src/components/ui."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Wire LanguageSelector into the header: (1) on md+ desktop nav row, render it immediately to the right of the existing \"News\" link; (2) on mobile (<md), render it next to the existing hamburger menu button while preserving current Sheet behavior and layout."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement shared language selection state (default English) with an exact fixed list of languages and visual indication of the selected item.",
      "acceptanceCriteria": [
        "On first load (with no prior selection), English is selected by default.",
        "The menu lists the languages: English, Hindi, Kazakhstan, Chinese, Spanish, Thailand, Russian, Japanese, French, Portugese, Italian, Arabic, Tagalog, Vietnamese, Indonesian.",
        "When a user selects a language, the menu indicates the selected language (e.g., checkmark or highlighted state).",
        "The selected language is available to the rest of the app via a shared state mechanism (e.g., context/provider or a dedicated hook)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/context/LanguageContext.tsx",
          "operation": "create",
          "description": "Add a LanguageProvider + React context that exposes the current language, the fixed allowed language list (exact labels), and a setter; initialize to English when no prior selection exists."
        },
        {
          "path": "frontend/src/hooks/useLanguage.ts",
          "operation": "create",
          "description": "Create a dedicated hook that provides typed access to the LanguageContext (current language, available languages, setLanguage) for use across the app."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the routed application with LanguageProvider (without modifying frontend/src/main.tsx) so the selected language is available as shared state throughout the app."
        },
        {
          "path": "frontend/src/components/LanguageSelector.tsx",
          "operation": "modify",
          "description": "Connect LanguageSelector to the shared language state via useLanguage; render the menu items for exactly the specified languages, and visually indicate the currently selected language (e.g., checkmark and/or highlighted item styles)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Persist selected language on the client and restore it on refresh/reopen with English as fallback.",
      "acceptanceCriteria": [
        "After selecting a non-English language and refreshing the page, the selected language remains the same.",
        "If persisted language data is cleared, the app returns to English as the default on next load."
      ],
      "file_operations": [
        {
          "path": "frontend/src/context/LanguageContext.tsx",
          "operation": "modify",
          "description": "Add client persistence using localStorage: on provider mount, load and validate the stored language against the allowed list; on changes, persist the selected language; if missing/invalid, fall back to English."
        },
        {
          "path": "frontend/src/hooks/useLanguage.ts",
          "operation": "modify",
          "description": "Ensure the hook’s exposed API reflects the persisted/rehydrated current selection and remains stable for consumers (no additional app-wide wiring changes required)."
        }
      ]
    }
  ]
}